Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/travel_and_recreation/travel_abroad/passports/renewing_an_irish_passport.html.txt.tmx
Source language: en
Languages: ga

source: The Passport Service provides a Passport Tracking Service
ga: Cuireann an tSeirbhís Pasanna Seirbhís um Rianú Pas ar fáil

source: This service allows you to check the status of your application online
ga: Ligeann an tseirbhís seo duit stádas d’iarratais a sheiceáil ar líne

source: In order to do this, you must have the application number from your form (available in the top left-hand corner of the form) to do this
ga: Chun déanamh amhlaidh, ní mór duit an uimhir iarratais ó d’fhoirm (le fáil ag barr na foirme ar chlé) a bheith agat

source: Pilot Rapid Renewal Service
ga: Seirbhís Athnuachan Mear Píolótach

source: A Pilot Rapid Renewal Service has been introduced in the Dublin Passport Office for adults and children who are renewing their passport and who are travelling in less than 3 working days
ga: Tá Seirbhís Athnuachan Mear Píolótach tús curtha ag an Oifig na bPasanna i mBaile Átha Cliath do dhaoine fásta agus do pháistí atá ag iarraidh a athnuachan a n-pasanna agus atá siad ag taisteal i níos lú ná 3 lá oibre

source: You can make an appointment for the Rapid Renewal Service at passportappointments.ie
ga: Is féidir leat a dhéanamh coinne don tSeirbhís Athnuachan mear ag passportappointments.ie

source: In cases of genuine emergency, the duty officer at the Department of Foreign Affairs and Trade can issue an emergency travel document of limited validity
ga: I gcásanna fíoréigeandála, féadann an t-oifigeach dualgais ag an Roinn Gnóthaí Eachtracha agus Trádála pas éigeandála lena mbaineann bailíocht theoranta a eisiúint

source: Examples of such emergencies are:
ga: Ar na samplaí de na héigeandálaí sin tá:

source: • Situations of substantial distress such as the deaths or funerals of immediate family members abroad
ga: • Cásanna anacra móire amhail básanna nó sochraidí gaolta thar lear • Gnó práinneach thar lear, go háirithe nuair atá Éire ar an tairbhí

source: • Urgent medical attention abroad
ga: • Aire práinneach míochaine thar lear

source: It is not possible for an emergency travel document to issue to minors (except in extremely limited circumstances), to first time applicants or in cases that do not involve a medical emergency or family bereavement
ga: • Póstaí thar lear nó sa chás go n-aimsíonn páirtnéir i lánúin atá ag dul ar mhí na meala go bhfuil pas caillte nó ligthe amú

source: There is a charge of €110 for this out-of-hours emergency service
ga: Tá táille €110 ar an tseirbhís éigeandála as uaireanta seo

source: Emergency travel documents may also be issued by Irish embassies or consulates, to replace a passport that is lost or stolen abroad
ga: Tá an pas éigeandála bailí ar feadh tréimhse theoranta. Caithfear iarratas ar phas rialta a dhéanamh ina dhiaidh sin

source: When you receive your passport, you should sign it
ga: Nuair a fhaigheann tú do phas, ba chóir duit a shíniú

source: In the case of a child’s passport, the child should sign it
ga: I gcás phas linbh, ba chóir an páiste a shíniú

source: If the child is not able to sign their name, it should be left blank
ga: Mura bhfuil an leanbh in ann a n-ainm a shíniú, ba cheart é a fhágáil bán

source: If applying from within the State, you can renew your Irish passport online or use Passport Express
ga: Ba cheart duit úsáid a bhaint as Seirbhís na bPasanna Luais más ag déanamh iarratais ó áit laistigh den Stát atá tú

source: If you are using Passport Express, you can hand in your application at your nearest Service Plus Post Office
ga: Cuir d’iarratais isteach ag an Oifig Phoist ‘Service Plus’ is cóngaraí duit

source: Applying in person at a Passport Office should only be done by those who have immediate travel plans or a necessity to travel for reasons of family emergency
ga: Níor cheart ach do dhaoine ag a bhfuil pleananna taistil láithrigh nó ag a bhfuil gá le taisteal chun críche éigeandáil teaghlaigh agat iarratas a dhéanamh go pearsanta ag ceann ar bith d’Oifigí na bPasanna

source: If applying from outside the State, you can renew your Irish passport online or send a completed application to the nearest Irish embassy or consulate, or hand it in at the nearest participating Northern Ireland Post Office if using Passport Express
ga: Más rud é go bhfuil tú ag déanamh iarratais ó áit lasmuigh den Stát, seol an t-iarratas comhlánaithe chuig an ambasáid Éireannach nó chuig an gconsalacht Éireannach is cóngaraí duit, nó cuir isteach é ag an Oifig Phoist rannpháirteach is cóngaraí i dTuaisceart Éireann más ag úsáid Sheirbhís na bPasanna Luais atá tú

source: You can order birth, marriage, civil partnership and adoption certificates online from the HSE
ga: Is féidir leat teastas breithe, teastas pósta, teastas páirtnéireachta sibhialta agus teastas uchtála a ordú ar líne ó FSS
